Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateRailGeom Property
 Can't create geometry for one or more Rails
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateRailGeom { get; }
Public Shared ReadOnly Property CannotCreateRailGeom As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateRailGeom {
	FailureDefinitionId^ get ();
}
static member CannotCreateRailGeom : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace